{"modelTopology": {"keras_version": "2.1.4", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 28, 28]}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "units": 5, "trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_1", "use_bias": true, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "units": 10, "trainable": true, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_2", "use_bias": true, "bias_constraint": null, "kernel_constraint": null}}]}, "backend": "tensorflow", "training_config": {"optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "decay": 0.0, "momentum": 0.0, "lr": 0.009999999776482582}}, "metrics": [], "loss": "categorical_crossentropy", "loss_weights": null, "sample_weight_mode": null}}, "weightsManifest": [{"weights": [{"name": "dense_1/kernel", "shape": [784, 5], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [5], "dtype": "float32"}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "dense_2/kernel", "shape": [5, 10], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [10], "dtype": "float32"}], "paths": ["group2-shard1of1"]}]}